import 'package:flutter/material.dart';
import 'package:salat_w_azkar_elmuslim/core/widgets.dart';

class PrayAzkar extends StatelessWidget {
  final String title;
  const PrayAzkar({Key? key, required this.title}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(title, style: const TextStyle(fontWeight: FontWeight.bold)),
        centerTitle: true,
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [
            const SizedBox(height: 15),
            zekr(
                text1: '',
                text2:
                    'أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله. \nاللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام .',
                text3: '',
                times: 1,
                context: context),
            zekr(
                text1: '',
                text2:
                    'لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد.',
                text3: '',
                times: 1,
                context: context),
            zekr(
                text1: '',
                text2:
                    'لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون.',
                text3: '',
                times: 1,
                context: context),
            zekr(
                text1: '',
                text2: 'سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر.',
                text3: '',
                times: 33,
                context: context),
            zekr(
                text1: '',
                text2:
                    'لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير.',
                text3: '',
                times: 1,
                context: context),
            zekr(
              text1: 'اعوذ بالله من الشيطان الرجيم',
              text2:
                  'اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.',
              text3:
                  'من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.',
              times: 1,
              context: context,
            ),
            zekr(
              text1: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
              text2:
                  'قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.',
              text3:
                  'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
              times: 3,
              context: context,
            ),
            zekr(
              text1: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
              text2:
                  'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.',
              text3: '',
              times: 3,
              context: context,
            ),
            zekr(
              text1: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
              text2:
                  'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.',
              text3: '',
              times: 3,
              context: context,
            ),
            zekr(
                text1: '',
                text2:
                    'لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير.',
                text3: 'عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح.',
                times: 10,
                context: context),
            zekr(
                text1: '',
                text2:
                    'اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً.',
                text3: 'بَعْد السّلامِ من صَلاةِ الفَجْر.',
                times: 1,
                context: context),
            zekr(
                text1: '',
                text2: 'اللَّهُمَّ أَجِرْنِي مِنْ النَّار.',
                text3: 'بَعْدَ المَغْرِب وَالصّـبْح.',
                times: 7,
                context: context),
            zekr(
                text1: '',
                text2:
                    'اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ.',
                text3: '',
                times: 1,
                context: context),
          ],
        ),
      ),
    );
  }
}
