import 'package:flutter/material.dart';
import 'package:salat_w_azkar_elmuslim/core/widgets.dart';

class Tasabeh extends StatelessWidget {
  final String title;
  const Tasabeh({Key? key, required this.title}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(title, style: const TextStyle(fontWeight: FontWeight.bold)),
        centerTitle: true,
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [
            const SizedBox(height: 15),
            zekr(
              text1: '',
              text2: 'سُبْحَانَ اللَّهِ',
              text3: 'يكتب له ألف حسنة أو يحط عنه ألف خطيئة.',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2: 'سُبْحَانَ الله و بحمدِه',
              text3:
                  'حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2: 'سُبْحَانَ اللَّهِ و َالْحَمْدُ لِلَّهِ',
              text3: 'تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ.',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2: 'سبحان الله العظيم وبحمده',
              text3: 'غرست له نخلة في الجنة (أى عدد).',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2:
                  'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ',
              text3: 'ثقيلتان في الميزان حبيبتان إلى الرحمن (أى عدد).',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2: 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ',
              text3: 'تملأ ميزان العبد بالحسنات.',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2: 'لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ',
              text3: 'كنز من كنوز الجنة (أى عدد).',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2:
                  'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ. ',
              text3:
                  'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2:
                  'الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد',
              text3: 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2: 'أستغفر الله',
              text3: 'لفعل الرسول صلى الله عليه وسلم.',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2:
                  'سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ',
              text3:
                  'أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات.',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2: 'لَا إِلَهَ إِلَّا اللَّهُ',
              text3: 'أفضل الذكر لا إله إلاّ الله.',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2: 'الْلَّهُ أَكْبَرُ',
              text3:
                  'من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء.',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2:
                  'سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِي.',
              text3: 'خير الدنيا والآخرة',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2:
                  'الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ.',
              text3:
                  'قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ "لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا".',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2:
                  'اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً.',
              text3:
                  'قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ "عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ".',
              times: 100,
              context: context,
            ),
            zekr(
              text1: '',
              text2:
                  'اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.',
              text3:
                  'في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم (أى عدد).',
              times: 100,
              context: context,
            ),
          ],
        ),
      ),
    );
  }
}
